"""
元组一但被定义完成，不可修改
元组是不可变的的序列，但创建后不能修改

特点：元素可以重复、有序、不可以修改（仅支持索引、切片）
可以存储不同类型的元素


基本操作
组包: 将多个值合并到一个容器（元组、列表）中
解包：将容器中的元素分别赋值个多个变量
"""

# 元组基本操作 - tuple

# 定义元组
# t1 = (1,2,3,4,5,3,4,5,6,7,8,9,10)
# print(t1)
# print(type(t1))
#
# # 索引访问
# print(t1[0])
# print(t1[-1])

# # 清空元组
# t2 = ()
# t3 = tuple ()

# conut() : # 获取元素索引
# print(t1.count(3))
# # index() 查找某个元素在元组中的索引位置（如果出现重复的元组，获取第一次出现的位置）
# print(t1.index(3))
#
# # 注意点:如果定义氮元素的元组，单个元素之后要加上逗号，比如（100，）
# t2 = ()
# print(t2)
# print(type(t2))
#
# t3 = (100,)
# print(t3)
# print(type(t3))
#
# # 组包与解包
# t4 = (1,2,3,4)
# t4 = 1,2,3,4
#
# # 基础解包
# a, b, c, d = t4
#
# # （*）扩展解包(* 收集剩余的所有元素，封装列表list中)
# a, *b = t4 # a = 1
# print(a)
# print(b)

# # 案例1：现有两个变量，分别为：a = 10, b = 20，现需要将两个变量值交换，然后输出到控制台
# a = 10
# b = 20
#
#
# # 组包
# t = (a, b)
# # 解包
# a, b = t
# # 交换
# a, b = b, a
#
# print(a, b)

# 案例2：现有三个变量，分别为：a = 100, b = 200, c = 300，现需要将三个变量值交换，然后输出到控制台
a = 100
b = 200
c = 300

a, b, c = c, a, b
print(a, b, c)

